Revit 2027 API
JournalingAttribute Constructor
Constructs a new JournalingAttribute.
Namespace: Autodesk.Revit.Attributes
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public JournalingAttribute(
	JournalingMode mode
)
Public Sub New (
	mode As JournalingMode
)
public:
JournalingAttribute(
	JournalingMode mode
)
new :
        mode : JournalingMode -> JournalingAttribute
Parameters
mode JournalingMode
See Also
Reference
JournalingAttribute Class
Autodesk.Revit.Attributes Namespace